CF/DataProcessors/СопоставлениеНоменклатурыЕГАИСРТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>СопоставлениеНоменклатурыЕГАИСРТ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

CF/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ОсобенностиУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОсобенностиУчетаНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОсобенностейУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КиЗГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияМаркируемаяДляГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодАртикул</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КлассификаторАлкогольнойПродукцииЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНоменклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХарактеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСопоставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/DataProcessors/СопоставлениеНоменклатурыЕГАИСРТ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РежимСопоставленияПоНакладной = Параметры.РежимСопоставленияПоНакладной;
	
	ДополнительныеКолонкиНоменклатуры = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПриОтображенииНоменклатуры");
	
	УстановитьДополнительныеКолонкиНоменклатуры();
	
	ИспользоватьПодключаемоеОборудование = ЗначениеНастроекВызовСервера.ИспользоватьПодключаемоеОборудование();
	
	Если Параметры.Свойство("ТТН") Тогда
		ТТН = Параметры.ТТН;
	КонецЕсли;
	
	ПроизводилисьДействия = Ложь;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАлкогольнойПродукцииЕГАИС, "ТТН", ТТН);
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокНоменклатуры,
		"АлкогольнаяПродукция",
		Истина,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	
	Если Параметры.Свойство("АдресВХранилище") И ЗначениеЗаполнено(Параметры.АдресВХранилище) Тогда
		
		СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
		
		Если СтруктураДанных.Свойство("НеСопоставленныеТовары") Тогда
			ТаблицаТоваров = ПолучитьИзВременногоХранилища(СтруктураДанных.НеСопоставленныеТовары);
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокАлкогольнойПродукцииЕГАИС, "Ссылка", ТаблицаТоваров.ВыгрузитьКолонку("АлкогольнаяПродукция"), Истина, ВидСравненияКомпоновкиДанных.ВСписке);
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("АлкогольнаяПродукция") Тогда
			Если ЗначениеЗаполнено(СтруктураДанных.АлкогольнаяПродукция) Тогда
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокАлкогольнойПродукцииЕГАИС, "Ссылка", СтруктураДанных.АлкогольнаяПродукция, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("Номенклатура") Тогда
			Если ЗначениеЗаполнено(СтруктураДанных.Номенклатура) Тогда
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокНоменклатуры, "Ссылка", СтруктураДанных.Номенклатура, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.Свойство("РежимВыбора") Тогда
			РежимВыбора = Параметры.РежимВыбора;
			Элементы.ФормаВыбратьНоменклатуру.Видимость         = РежимВыбора;
			Элементы.ФормаВыбратьНоменклатуру.КнопкаПоУмолчанию = РежимВыбора;
			Элементы.ФормаУстановитьСоответствие.Видимость      = НЕ РежимВыбора;
			Элементы.ГруппаСтраницыАлкогольнойПродукции.ТекущаяСтраница = Элементы.ГруппаАлкогольнаяПродукция;
			
		ИначеЕсли Параметры.Свойство("РежимСопоставленияИВыбора") и СтруктураДанных.Свойство("АлкогольнаяПродукция") и ЗначениеЗаполнено(СтруктураДанных.АлкогольнаяПродукция) Тогда
			РежимСопоставленияИВыбора = Параметры.РежимСопоставленияИВыбора;
			
			АлкогольнаяПродукция = СтруктураДанных.АлкогольнаяПродукция;
			РеквизитыАлкогольнойПродукции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.АлкогольнаяПродукция, "Объем, Крепость, ВидПродукции, Производитель, Импортер");
			
			АлкогольнаяПродукцияОбъем         = РеквизитыАлкогольнойПродукции.Объем;
			АлкогольнаяПродукцияКрепость      = РеквизитыАлкогольнойПродукции.Крепость;
			АлкогольнаяПродукцияВидПродукции  = РеквизитыАлкогольнойПродукции.ВидПродукции;
			АлкогольнаяПродукцияПроизводитель = РеквизитыАлкогольнойПродукции.Производитель;
			АлкогольнаяПродукцияИмпортер      = РеквизитыАлкогольнойПродукции.Импортер;
			
			Элементы.ФормаСопоставитьИВыбрать.Видимость         = РежимСопоставленияИВыбора;
			Элементы.ФормаСопоставитьИВыбрать.КнопкаПоУмолчанию = РежимСопоставленияИВыбора;
			Элементы.ФормаУстановитьСоответствие.Видимость      = НЕ РежимСопоставленияИВыбора;
			Элементы.ФормаОтменитьСоответствие.Видимость        = НЕ РежимСопоставленияИВыбора;
			
			Элементы.ГруппаСтраницыАлкогольнойПродукции.ТекущаяСтраница = Элементы.ГруппаАлкогольнаяПродукцияИнформация;
			
			ОбновитьИнформациюОСопоставленииКонтрагентовНаСервере();
			
		Иначе
			Элементы.ГруппаСтраницыАлкогольнойПродукции.ТекущаяСтраница = Элементы.ГруппаАлкогольнаяПродукция;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(, ЭтаФорма, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
	Если ИспользоватьОтборПоСвойствам Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборНоменклатуры", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(, ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТТН) И ПроизводилисьДействия Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет'"));
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПередЗакрытиемВопросЗавершение", ЭтотОбъект),
			НСтр("ru = 'Закрыть форму сопоставления?'"), СписокКнопок);
			
			Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ВосстановитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	ПроизводилисьДействия = Истина;
	
	Если РежимСопоставленияИВыбора Тогда
		
		Если Элементы.СписокНоменклатуры.ВыделенныеСтроки.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
		Если Элементы.ГруппаСопоставитьПоизводителя.Видимость или Элементы.ГруппаСопоставитьИмпортера.Видимость Тогда
			Если Элементы.ГруппаСопоставитьПоизводителя.Видимость и не Элементы.ГруппаСопоставитьИмпортера.Видимость Тогда
				ОрганизацииЕГАИСДляСопоставления = АлкогольнаяПродукцияПроизводитель;
			ИначеЕсли не Элементы.ГруппаСопоставитьПоизводителя.Видимость и Элементы.ГруппаСопоставитьИмпортера.Видимость Тогда
				ОрганизацииЕГАИСДляСопоставления = АлкогольнаяПродукцияИмпортер;
			Иначе
				ОрганизацииЕГАИСДляСопоставления = Новый Структура();
				ОрганизацииЕГАИСДляСопоставления.Вставить("Производитель", АлкогольнаяПродукцияПроизводитель);
				ОрганизацииЕГАИСДляСопоставления.Вставить("Импортер", АлкогольнаяПродукцияИмпортер);
			КонецЕсли;
			ПоказатьВопросСопоставленияОрганизацииЕГАИС(НСтр("ru = 'До сопоставления номенклатуры необходимо выполнить сопоставление организаций. Открыть форму сопоставления организаций?'")
				, ОрганизацииЕГАИСДляСопоставления);
			Возврат;
		КонецЕсли;
	Иначе
		
		Если Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки.Количество() = 0 
			ИЛИ Элементы.СписокНоменклатуры.ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьНеСопоставленныеОрганизацииНаСервере();
		
		Если ТаблицаНеСопоставленныеПроизводительИмпортер.Количество() > 0 Тогда 
			ПоказатьВопросСопоставленияОрганизацииЕГАИС(НСтр("ru = 'До сопоставления номенклатуры необходимо выполнить сопоставление организаций. 
															|Открыть форму сопоставления организаций?'"));
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РежимСопоставленияИВыбора Тогда
		ТекущаяАлкогольнаяПродукция = АлкогольнаяПродукция;
	Иначе
		ТекущаяАлкогольнаяПродукция = Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если НЕ ПроверитьВозможностьУстановкиСоответствия(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	АдресВХранилище = ЗаполнитьСпискиНеСопоставленныхНаСервере();	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВХранилище", АдресВХранилище);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("УстановитьСоответствие_Завершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.СопоставлениеНоменклатурыЕГАИСРТ.Форма.ФормаСопоставленияНоменклатуры", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеПриЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие_Завершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура")
		и РезультатЗакрытия.Свойство("СопоставлениеВыполнено")
		и РезультатЗакрытия.СопоставлениеВыполнено Тогда
		Если РежимСопоставленияИВыбора Тогда
			ВыбратьНоменклатуруКлиент(РезультатЗакрытия);
		Иначе
			Элементы.СписокАлкогольнойПродукцииЕГАИС.Обновить();
			Элементы.СписокНоменклатуры.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствие(Команда)
	
	МассивЭлементов = Новый Массив;
	
	Для каждого АлкогольнаяПродукцияСписка Из Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки Цикл
	
		ДанныеСтроки = Элементы.СписокАлкогольнойПродукцииЕГАИС.ДанныеСтроки(АлкогольнаяПродукцияСписка);
		Если НЕ ДанныеСтроки.НоменклатураСопоставлена = 0 Тогда
			МассивЭлементов.Добавить(ДанныеСтроки.Ссылка);
		КонецЕсли;
	
	КонецЦикла;
	
	Если МассивЭлементов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АдресМассиваАлкогольнойПродукции = ПоместитьВоВременноеХранилище(МассивЭлементов, УникальныйИдентификатор);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОтменитьСоответствие_Завершение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеПриЗавершении, НСтр("ru = 'Отменить связь выбранной алкогольной продукции?'"), РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствие_Завершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОтменитьСоответствие", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОбработкаТабличнойЧастиТоварыКлиент.ВвестиШтрихкод(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	ПроизводилисьДействия = Истина;
	
	МассивЭлементов = Новый Массив();
	
	Если РежимСопоставленияИВыбора Тогда
		МассивЭлементов.Добавить(АлкогольнаяПродукция);
	Иначе
		ВыделенныеСтроки = Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки;
		
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.СписокАлкогольнойПродукцииЕГАИС.ДанныеСтроки(ИдентификаторСтроки);
			Если ДанныеСтроки <> Неопределено Тогда
				МассивЭлементов.Добавить(ДанныеСтроки.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если МассивЭлементов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("СоздатьНоменклатуру_Подтверждение", ЭтотОбъект, МассивЭлементов);
	ПоказатьВопрос(ОповещениеПриЗавершении, НСтр("ru = 'Создать номенклатуру по выделенным строкам алкогольной продукции?'"), РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру_Подтверждение(РезультатВопроса, ВыделенныеСтроки) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	АдресСпискаАлкогольнойПродукции = ПоместитьВоВременноеХранилище(ВыделенныеСтроки, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаАлкогольнойПродукции", АдресСпискаАлкогольнойПродукции);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("СоздатьНоменклатуру_Завершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.СопоставлениеНоменклатурыЕГАИСРТ.Форма.ФормаСозданияНоменклатуры", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеПриЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру_Завершение(ПараметрыСозданияНоменклатуры, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ПараметрыСозданияНоменклатуры) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	АдресПараметровСозданияНоменклатуры = ПоместитьВоВременноеХранилище(ПараметрыСозданияНоменклатуры, УникальныйИдентификатор);
	
	ПодключитьОбработчикОжидания("Подключаемый_СоздатьНоменклатуру", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНоменклатуру(Команда)
	
	ВыбратьНоменклатуруКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьИВыбрать(Команда)
	
	Если Элементы.ГруппаСопоставитьПоизводителя.Видимость или Элементы.ГруппаСопоставитьИмпортера.Видимость Тогда
		Если Элементы.ГруппаСопоставитьПоизводителя.Видимость и не Элементы.ГруппаСопоставитьИмпортера.Видимость Тогда
			ОрганизацииЕГАИСДляСопоставления = АлкогольнаяПродукцияПроизводитель;
		ИначеЕсли не Элементы.ГруппаСопоставитьПоизводителя.Видимость и Элементы.ГруппаСопоставитьИмпортера.Видимость Тогда
			ОрганизацииЕГАИСДляСопоставления = АлкогольнаяПродукцияИмпортер;
		Иначе
			ОрганизацииЕГАИСДляСопоставления = Новый Структура();
			ОрганизацииЕГАИСДляСопоставления.Вставить("Производитель", АлкогольнаяПродукцияПроизводитель);
			ОрганизацииЕГАИСДляСопоставления.Вставить("Импортер", АлкогольнаяПродукцияИмпортер);
		КонецЕсли;
		ПоказатьВопросСопоставленияОрганизацииЕГАИС(НСтр("ru = 'До сопоставления номенклатуры необходимо выполнить сопоставление организаций. Открыть форму сопоставления организаций?'")
			, ОрганизацииЕГАИСДляСопоставления);
		Возврат;
	КонецЕсли;
	
	УстановитьСоответствие(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлкогольнуюПродукцию(Команда)
	
	ТекущиеДанные = Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТТНПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАлкогольнойПродукцииЕГАИС, "ТТН", ТТН);
	
	Элементы.СписокАлкогольнойПродукцииЕГАИС.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораСоответствийАлкогольнаяПродукцияПриИзменении(Элемент)
	
	УстановитьОтборПоСоответствиюАлкогольнаяПродукция(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораСоответствийНоменклатураПриИзменении(Элемент)
	
	УстановитьОтборПоСоответствиюНоменклатура(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСвойствамПриИзменении(Элемент)
	
	УстановитьОтборНоменклатурыПоСвойствамАлкогольнойПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваОтбораНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокСвойствСПометками = Новый СписокЗначений;
	СписокСвойствСПометками.Добавить("Объем"        , НСтр("ru='Объем'")        , СвойстваОтбораНоменклатуры.НайтиПоЗначению("Объем")         <> Неопределено);
	СписокСвойствСПометками.Добавить("Крепость"     , НСтр("ru='Крепость'")     , СвойстваОтбораНоменклатуры.НайтиПоЗначению("Крепость")      <> Неопределено);
	СписокСвойствСПометками.Добавить("ВидПродукции" , НСтр("ru='Вид продукции'"), СвойстваОтбораНоменклатуры.НайтиПоЗначению("ВидПродукции")  <> Неопределено);
	СписокСвойствСПометками.Добавить("Производитель", НСтр("ru='Производитель'"), СвойстваОтбораНоменклатуры.НайтиПоЗначению("Производитель") <> Неопределено);
	СписокСвойствСПометками.Добавить("Импортер"     , НСтр("ru='Импортер'")     , СвойстваОтбораНоменклатуры.НайтиПоЗначению("Импортер")      <> Неопределено);
	
	СписокСвойствСПометками.ПоказатьОтметкуЭлементов(
		Новый ОписаниеОповещения("ОтметкаСвойствОтбора_Завершение", ЭтотОбъект),
		НСтр("ru='Список свойств для отбора'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваОтбораНоменклатурыОчистка(Элемент, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборНоменклатуры", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицФормы

&НаКлиенте
Процедура СписокАлкогольнойПродукцииЕГАИСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено И НЕ Элемент.ТекущиеДанные.НоменклатураСопоставлена = 0 Тогда
		СвязаннаяНоменклатура = ПолучитьСписокСвязаннойНоменклатуры(Элемент.ТекущиеДанные.Ссылка);
		Если СвязаннаяНоменклатура.Количество() > 0 Тогда 
			Элементы.СписокНоменклатуры.ВыделенныеСтроки.Очистить();
			Элементы.СписокНоменклатуры.ТекущаяСтрока = СвязаннаяНоменклатура[0];
			Для Каждого ДанныеСопоставления Из СвязаннаяНоменклатура Цикл
				Элементы.СписокНоменклатуры.ВыделенныеСтроки.Добавить(ДанныеСопоставления);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущийЭлемент = Элементы.СписокАлкогольнойПродукцииЕГАИСПроизводительИмпортерНеСопоставлены
		И Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущиеДанные.ПроизводительИмпортерНеСопоставлены Тогда
		
		МассивОрганизацийЕГАИСДляСопоставления = Новый Массив();
		МассивОрганизацийЕГАИСДляСопоставления.Добавить(Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущиеДанные.Производитель);
		МассивОрганизацийЕГАИСДляСопоставления.Добавить(Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущиеДанные.Импортер);
		
		ОткрытьФормуСопоставленияОрганизацииЕГАИС(МассивОрганизацийЕГАИСДляСопоставления);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если РежимСопоставленияИВыбора Тогда
		Возврат;
	ИначеЕсли РежимВыбора Тогда
		ВыбратьНоменклатуруКлиент();
	ИначеЕсли Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.ЕстьСоответствие Тогда
		СвязаннаяАлкогольнаяПродукция = ПолучитьСписокСвязаннойАлкогольнойПродукции(Элемент.ТекущиеДанные.Ссылка);
		
		Если СвязаннаяАлкогольнаяПродукция.Количество() > 0 Тогда
			Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки.Очистить();
			
			Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущаяСтрока = СвязаннаяАлкогольнаяПродукция[0];
			
			Для Каждого ДанныеСопоставления Из СвязаннаяАлкогольнаяПродукция Цикл
				Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки.Добавить(ДанныеСопоставления);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАлкогольнойПродукцииЕГАИСПриАктивизацииСтроки(Элемент)
	
	Если ИспользоватьОтборПоСвойствам Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборНоменклатуры", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПодключаемогоОборудования

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПустаяСтрока(Штрихкод) Тогда
		СтруктураПараметровКлиента = ПолученШтрихкодИзСШК(Штрихкод);
		ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораДанныхПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьДанныеПоКодуСервер(Результат);
		ОбработатьДанныеПоКодуКлиент(Результат)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолученШтрихкодИзСШК(Штрихкод) Экспорт
	
	СтруктураРезультат = ПодключаемоеОборудованиеРТВызовСервера.ПолученШтрихкодИзСШК(Штрихкод, ЭтотОбъект);
	Возврат СтруктураРезультат;
	
КонецФункции

&НаСервере
Процедура ОбработатьДанныеПоКодуСервер(СтруктураРезультат) Экспорт
	
	СтрокаРезультата = СтруктураРезультат.ЗначенияПоиска[0];
	
	Если СтрокаРезультата.Свойство("Карта") Тогда
		
		ПодключаемоеОборудованиеРТВызовСервера.ВставитьПредупреждениеОНевозможностиОбработкиКарт(СтруктураРезультат, СтрокаРезультата);
		
	Иначе
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.СписокНоменклатуры;
		Элементы.СписокНоменклатуры.ТекущаяСтрока = СтрокаРезультата.Номенклатура;
		СтруктураРезультат.Вставить("ИтоговаяНоменклатура", СтрокаРезультата.Номенклатура);
		
	КонецЕсли;
	
	Если СтрокаРезультата.Свойство("ТекстПредупреждения") Тогда
		СтруктураРезультат.Вставить("ТекстПредупреждения", СтрокаРезультата.ТекстПредупреждения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента) Экспорт
	
	ОткрытаБлокирующаяФорма = Ложь;
	Если СтруктураПараметровКлиента.Свойство("ИтоговаяНоменклатура") Тогда
		Если Элементы.СписокНоменклатуры.ТекущаяСтрока <> СтруктураПараметровКлиента.ИтоговаяНоменклатура Тогда
			ТекстПредупреждения = НСтр("ru = 'Найденная номенклатура ""%1"" не соответствует установленному отбору'");
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, СтруктураПараметровКлиента.ИтоговаяНоменклатура);
			СтруктураПараметровКлиента.Вставить("ТекстПредупреждения", ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
	ПодключаемоеОборудованиеРТКлиент.ОбработатьДанныеПоКоду(ЭтотОбъект, СтруктураПараметровКлиента, ОткрытаБлокирующаяФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_СоздатьНоменклатуру()
	
	СозданнаяНоменклатура = СоздатьНоменклатуруНаСервере(АдресПараметровСозданияНоменклатуры);
	
	Элементы.СписокАлкогольнойПродукцииЕГАИС.Обновить();
	Элементы.СписокНоменклатуры.Обновить();
	
	Элементы.СписокНоменклатуры.ВыделенныеСтроки.Очистить();
	
	Номенклатура = Неопределено;
	
	Для каждого Номенклатура Из СозданнаяНоменклатура Цикл
		Элементы.СписокНоменклатуры.ВыделенныеСтроки.Добавить(Номенклатура);
	КонецЦикла;
	
	Если РежимВыбора или РежимСопоставленияИВыбора И ЗначениеЗаполнено(Номенклатура) Тогда
		Закрыть(Номенклатура);
		Возврат;
	КонецЕсли;
	
	Если СозданнаяНоменклатура.Количество() = 1 Тогда
		ТекстСообщения = НСтр("ru = 'Создан элемент номенклатуры %Наименование%.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Наименование%", СокрЛП(СозданнаяНоменклатура[0]));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, СозданнаяНоменклатура[0]);
	Иначе
		ТекстСообщения = НСтр("ru = 'Создано %Количество% элементов номенклатуры.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", СозданнаяНоменклатура.Количество());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьСоответствие()
	
	ОтменитьСоответствиеНаСервере(ПолучитьИзВременногоХранилища(АдресМассиваАлкогольнойПродукции));
	
	Элементы.СписокАлкогольнойПродукцииЕГАИС.Обновить();
	Элементы.СписокНоменклатуры.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНоменклатуруНаСервере(АдресПараметровСозданияНоменклатуры)
	
	СозданнаяНоменклатура = Новый Массив;
	
	ПараметрыСозданияНоменклатуры = ПолучитьИзВременногоХранилища(АдресПараметровСозданияНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого АлкогольнаяПродукцияСписка Из ПараметрыСозданияНоменклатуры.МассивЭлементов Цикл
		
		РеквизитыАлкогольнойПродукции = ПолучитьРеквизитыАлкогольнойПродукции(АлкогольнаяПродукцияСписка);
		
		НоменклатураОбъект  = Справочники.Номенклатура.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоменклатураОбъект, РеквизитыАлкогольнойПродукции,, "Производитель");
		
		НоменклатураОбъект.Родитель             = ПараметрыСозданияНоменклатуры.Родитель;
		НоменклатураОбъект.АлкогольнаяПродукция = Истина;
		НоменклатураОбъект.ОсобенностьУчета     = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция;
		НоменклатураОбъект.ВидНоменклатуры      = ПараметрыСозданияНоменклатуры.ВидНоменклатуры;
		НоменклатураОбъект.НаборУпаковок        = ПараметрыСозданияНоменклатуры.НаборУпаковок;
		НоменклатураОбъект.ЕдиницаИзмерения     = ПараметрыСозданияНоменклатуры.ЕдиницаИзмерения;
		НоменклатураОбъект.СтавкаНДС            = ПараметрыСозданияНоменклатуры.СтавкаНДС;
		НоменклатураОбъект.ТоварнаяГруппа       = ПараметрыСозданияНоменклатуры.ТоварнаяГруппа;
		НоменклатураОбъект.ЦеноваяГруппа        = ПараметрыСозданияНоменклатуры.ЦеноваяГруппа;
		НоменклатураОбъект.СтранаПроисхождения  = ПараметрыСозданияНоменклатуры.СтранаПроисхождения;
		
		ТекстОшибкиПроизводитель = "";
		ТекстОшибкиИмпортер = "";
		
		Если ЗначениеЗаполнено(РеквизитыАлкогольнойПродукции.ПроизводительЕГАИС) Тогда
			Если ЗначениеЗаполнено(РеквизитыАлкогольнойПродукции.Производитель) Тогда
				Если ЗначениеЗаполнено(РеквизитыАлкогольнойПродукции.ИмпортерЕГАИС) Тогда
					НоменклатураОбъект.Производитель = РеквизитыАлкогольнойПродукции.Производитель;
				Иначе
					НоменклатураОбъект.ПроизводительИмпортерАлкогольнойПродукции = РеквизитыАлкогольнойПродукции.Производитель;
				КонецЕсли;
			Иначе
				ТекстОшибкиПроизводитель = НСтр("ru = 'При создании номенклатуры %Наименование% не удалось определить сопоставленного производителя.'");
				ТекстОшибкиПроизводитель = СтрЗаменить(ТекстОшибкиПроизводитель, "%Наименование%", СокрЛП(НоменклатураОбъект.Наименование));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыАлкогольнойПродукции.ИмпортерЕГАИС) Тогда
			Если ЗначениеЗаполнено(РеквизитыАлкогольнойПродукции.Импортер) Тогда
				НоменклатураОбъект.ПроизводительИмпортерАлкогольнойПродукции = РеквизитыАлкогольнойПродукции.Импортер;
			Иначе
				ТекстОшибкиИмпортер = НСтр("ru = 'При создании номенклатуры %Наименование% не удалось определить сопоставленного импортера.'");
				ТекстОшибкиИмпортер = СтрЗаменить(ТекстОшибкиИмпортер, "%Наименование%", СокрЛП(НоменклатураОбъект.Наименование));
			КонецЕсли;
		КонецЕсли;
		
		НоменклатураОбъект.Записать();
		
		Если НЕ ПустаяСтрока(ТекстОшибкиПроизводитель) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибкиПроизводитель, НоменклатураОбъект.Ссылка);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстОшибкиИмпортер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибкиИмпортер, НоменклатураОбъект.Ссылка);
		КонецЕсли;
		
		Запись = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьМенеджерЗаписи();
		Запись.Номенклатура = НоменклатураОбъект.Ссылка;
		Запись.АлкогольнаяПродукция = АлкогольнаяПродукцияСписка;
		Запись.Порядок = 1;
		Запись.Записать();
		
		СозданнаяНоменклатура.Добавить(НоменклатураОбъект.Ссылка);
		
	КонецЦикла;
	
	Возврат СозданнаяНоменклатура;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыАлкогольнойПродукции(АлкогольнаяПродукция)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", АлкогольнаяПродукция);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Наименование,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.НаименованиеПолное,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Объем / 10 КАК ОбъемДАЛ,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Крепость,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции КАК ВидАлкогольнойПродукцииЕГАИС,
	|	ВЫБОР
	|		КОГДА КлассификаторАлкогольнойПродукцииЕГАИС.Производитель.Сопоставлено
	|			ТОГДА КлассификаторАлкогольнойПродукцииЕГАИС.Производитель.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Производитель,
	|	ВЫБОР
	|		КОГДА КлассификаторАлкогольнойПродукцииЕГАИС.Импортер.Сопоставлено
	|			ТОГДА КлассификаторАлкогольнойПродукцииЕГАИС.Импортер.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Импортер,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Производитель КАК ПроизводительЕГАИС,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Импортер КАК ИмпортерЕГАИС
	|ИЗ
	|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК КлассификаторАлкогольнойПродукцииЕГАИС
	|ГДЕ
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтменитьСоответствиеНаСервере(МассивАлкогольнойПродукции)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АлкогольнаяПродукция", МассивАлкогольнойПродукции);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыЕГАИС.Характеристика КАК Характеристика,
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	СоответствиеНоменклатурыЕГАИС.Справка2 КАК Справка2
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция В(&АлкогольнаяПродукция)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьУстановкиСоответствия(ТекстОшибки)
	
	Для Каждого СтрокаТаблицы Из Элементы.СписокНоменклатуры.ВыделенныеСтроки Цикл 
		Если СтрокаТаблицы.ЭтоГруппа Тогда
			ТекстОшибки = НСтр("ru = 'Связка алкогольной продукции с группой номенклатуры невозможна.'");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокСвязаннойАлкогольнойПродукции(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура";
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.АлкогольнаяПродукция);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокСвязаннойНоменклатуры(АлкогольнаяПродукция)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АлкогольнаяПродукция", АлкогольнаяПродукция);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = &АлкогольнаяПродукция";
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьДополнительныеКолонкиНоменклатуры()

	Элементы.СписокНоменклатурыКод.Видимость = ДополнительныеКолонкиНоменклатуры = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код
											ИЛИ ДополнительныеКолонкиНоменклатуры = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.КодАртикул;
	Элементы.СписокНоменклатурыАртикул.Видимость = ДополнительныеКолонкиНоменклатуры = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул
												ИЛИ ДополнительныеКолонкиНоменклатуры = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.КодАртикул;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьОтборНоменклатуры()
	
	УстановитьОтборНоменклатурыПоСвойствамАлкогольнойПродукции();
	
	Если Не РежимСопоставленияИВыбора Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.СписокАлкогольнойПродукцииЕГАИС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНоменклатурыПоСвойствамАлкогольнойПродукции()
	
	Если РежимСопоставленияИВыбора Тогда
		ТекущиеДанные = Новый Структура();
		ТекущиеДанные.Вставить("Объем", АлкогольнаяПродукцияОбъем);
		ТекущиеДанные.Вставить("Крепость", АлкогольнаяПродукцияКрепость);
		ТекущиеДанные.Вставить("ВидПродукции", АлкогольнаяПродукцияВидПродукции);
		ТекущиеДанные.Вставить("Производитель", АлкогольнаяПродукцияПроизводитель);
		ТекущиеДанные.Вставить("Импортер", АлкогольнаяПродукцияИмпортер);
	Иначе
		ТекущиеДанные = Элементы.СписокАлкогольнойПродукцииЕГАИС.ТекущиеДанные;
	КонецЕсли;
	
	ИспользованиеОтборов = ИспользоватьОтборПоСвойствам И ТекущиеДанные <> Неопределено;
	
	ГруппаОтбора = ОтборыСписковКлиентСервер.СоздатьГруппуЭлементовОтбора(
		СписокНоменклатуры.Отбор.Элементы,
		"ОтборПоСвойствамАлкогольнойПродукции",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
		ГруппаОтбора,
		"ОбъемДАЛ",
		?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Объем / 10),
		ИспользованиеОтборов И СвойстваОтбораНоменклатуры.НайтиПоЗначению("Объем") <> Неопределено И ТекущиеДанные.Объем <> 0,
		ВидСравненияКомпоновкиДанных.Равно);
		
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
		ГруппаОтбора,
		"Крепость",
		?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Крепость),
		ИспользованиеОтборов И СвойстваОтбораНоменклатуры.НайтиПоЗначению("Крепость") <> Неопределено И ТекущиеДанные.Крепость <> 0,
		ВидСравненияКомпоновкиДанных.Равно);
		
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
		ГруппаОтбора,
		"ВидАлкогольнойПродукцииЕГАИС",
		?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.ВидПродукции),
		ИспользованиеОтборов И СвойстваОтбораНоменклатуры.НайтиПоЗначению("ВидПродукции") <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ВидПродукции),
		ВидСравненияКомпоновкиДанных.Равно);
		
	Производитель = ?(ТекущиеДанные = Неопределено, Неопределено, ПолучитьКонтрагентаПоСоответствию(ТекущиеДанные.Производитель));
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
		ГруппаОтбора,
		"Производитель",
		?(ТекущиеДанные = Неопределено, Неопределено, Производитель),
		ИспользованиеОтборов И СвойстваОтбораНоменклатуры.НайтиПоЗначению("Производитель") <> Неопределено И ЗначениеЗаполнено(Производитель) И ЗначениеЗаполнено(ТекущиеДанные.Импортер),
		ВидСравненияКомпоновкиДанных.Равно);
		
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
		ГруппаОтбора,
		"ПроизводительИмпортерАлкогольнойПродукции",
		?(ТекущиеДанные = Неопределено, Неопределено, Производитель),
		ИспользованиеОтборов И СвойстваОтбораНоменклатуры.НайтиПоЗначению("Производитель") <> Неопределено И ЗначениеЗаполнено(Производитель) И НЕ ЗначениеЗаполнено(ТекущиеДанные.Импортер),
		ВидСравненияКомпоновкиДанных.Равно);
		
	Импортер = ?(ТекущиеДанные = Неопределено, Неопределено, ПолучитьКонтрагентаПоСоответствию(ТекущиеДанные.Импортер));
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораГруппыСписка(
		ГруппаОтбора,
		"ПроизводительИмпортерАлкогольнойПродукции",
		?(ТекущиеДанные = Неопределено, Неопределено, Импортер),
		ИспользованиеОтборов И СвойстваОтбораНоменклатуры.НайтиПоЗначению("Импортер") <> Неопределено И ЗначениеЗаполнено(Импортер),
		ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоСоответствиюАлкогольнаяПродукция(Форма)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Форма.СписокАлкогольнойПродукцииЕГАИС,
			"НоменклатураСопоставлена",
			0,
			НЕ Форма.ВариантОтбораСоответствийАлкогольнаяПродукция = "Все", 
			?(Форма.ВариантОтбораСоответствийАлкогольнаяПродукция = "Связанные", ВидСравненияКомпоновкиДанных.НеРавно, ВидСравненияКомпоновкиДанных.Равно));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоСоответствиюНоменклатура(Форма)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Форма.СписокНоменклатуры,
			"ЕстьСоответствие",
			Истина,
			НЕ Форма.ВариантОтбораСоответствийНоменклатура = "Все", 
			?(Форма.ВариантОтбораСоответствийНоменклатура = "Связанные", ВидСравненияКомпоновкиДанных.Равно, ВидСравненияКомпоновкиДанных.НеРавно));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоСоответствию(ОрганизацияЕГАИС)
	
	Если ОрганизацияЕГАИС.Пустая() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторОрганизацийЕГАИС.Контрагент
	|ИЗ
	|	Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|ГДЕ
	|	КлассификаторОрганизацийЕГАИС.Ссылка = &ОрганизацияЕГАИС
	|	И КлассификаторОрганизацийЕГАИС.Сопоставлено";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Контрагент;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьНоменклатуруКлиент(РезультатВыбора = Неопределено)
	
	Если РезультатВыбора = Неопределено Тогда
		
		ТекущиеДанныеНоменклатура = Элементы.СписокНоменклатуры.ТекущиеДанные;
		
		Если ТекущиеДанныеНоменклатура = Неопределено Тогда
			Закрыть();
		Иначе
			Закрыть(ТекущиеДанныеНоменклатура.Ссылка);
		КонецЕсли;
		
	Иначе
		Закрыть(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере(Знач Настройки)
	
	НастройкиПоУмолчанию = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Настройки.Получить("ВариантОтбораСоответствийАлкогольнаяПродукция")) Тогда
		Настройки.Вставить("ВариантОтбораСоответствийАлкогольнаяПродукция", "Все");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Настройки.Получить("ВариантОтбораСоответствийНоменклатура")) Тогда
		Настройки.Вставить("ВариантОтбораСоответствийНоменклатура", "Все");
	КонецЕсли;
	
	Если Настройки.Получить("ОтборПоОбъему") = Истина Тогда
		ЭлементСписка = СвойстваОтбораНоменклатуры.НайтиПоЗначению("Объем");
		Если ЭлементСписка = Неопределено Тогда
			СвойстваОтбораНоменклатуры.Добавить("Объем", НСтр("ru='Объем'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Настройки.Получить("ОтборПоКрепости") = Истина Тогда
		ЭлементСписка = СвойстваОтбораНоменклатуры.НайтиПоЗначению("Крепость");
		Если ЭлементСписка = Неопределено Тогда
			СвойстваОтбораНоменклатуры.Добавить("Крепость", НСтр("ru='Крепость'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Настройки.Получить("ОтборПоВидуПродукции") = Истина Тогда
		ЭлементСписка = СвойстваОтбораНоменклатуры.НайтиПоЗначению("ВидПродукции");
		Если ЭлементСписка = Неопределено Тогда
			СвойстваОтбораНоменклатуры.Добавить("ВидПродукции", НСтр("ru='Вид продукции'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Настройки.Получить("ОтборПоПроизводителю") = Истина Тогда
		ЭлементСписка = СвойстваОтбораНоменклатуры.НайтиПоЗначению("Производитель");
		Если ЭлементСписка = Неопределено Тогда
			СвойстваОтбораНоменклатуры.Добавить("Производитель", НСтр("ru='Производитель'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Настройки.Получить("ОтборПоИмпортеру") = Истина Тогда
		ЭлементСписка = СвойстваОтбораНоменклатуры.НайтиПоЗначению("Импортер");
		Если ЭлементСписка = Неопределено Тогда
			СвойстваОтбораНоменклатуры.Добавить("Импортер", НСтр("ru='Импортер'"));
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Настройка Из Настройки Цикл
		НастройкиПоУмолчанию.Вставить(Настройка.Ключ, Настройка.Значение);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиПоУмолчанию);
	
	УстановитьОтборПоСоответствиюАлкогольнаяПродукция(ЭтотОбъект);
	УстановитьОтборПоСоответствиюНоменклатура(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОСопоставленииКонтрагентов()
	
	ОбновитьИнформациюОСопоставленииКонтрагентовНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОСопоставленииКонтрагентовНаСервере()
	
	Если ЗначениеЗаполнено(АлкогольнаяПродукцияПроизводитель) Тогда
		ВидимостьГруппыСопоставитьПроизводителя = НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АлкогольнаяПродукцияПроизводитель, "Сопоставлено");
	Иначе
		ВидимостьГруппыСопоставитьПроизводителя = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АлкогольнаяПродукцияИмпортер) Тогда
		ВидимостьГруппыСопоставитьИмпортера = НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АлкогольнаяПродукцияИмпортер, "Сопоставлено");
	Иначе
		ВидимостьГруппыСопоставитьИмпортера = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаСопоставитьПоизводителя.Видимость = ВидимостьГруппыСопоставитьПроизводителя;
	Элементы.ГруппаСопоставитьИмпортера.Видимость = ВидимостьГруппыСопоставитьИмпортера;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьИмпортера(Команда)
	
	ОткрытьФормуСопоставленияОрганизацииЕГАИС(АлкогольнаяПродукцияИмпортер);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПроизводителя(Команда)
	
	ОткрытьФормуСопоставленияОрганизацииЕГАИС(АлкогольнаяПродукцияПроизводитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросСопоставленияОрганизацииЕГАИС(ТекстВопроса, ДанныеСопоставления = Неопределено)
	
	Если ТипЗнч(ДанныеСопоставления) = Тип("СправочникСсылка.КлассификаторОрганизацийЕГАИС") Тогда
		ОрганизацииЕГАИС = ДанныеСопоставления;
	Иначе
		ОрганизацииЕГАИС = Новый Массив();
		Для Каждого СтрокаТаблицы Из ТаблицаНеСопоставленныеПроизводительИмпортер Цикл 
			ОрганизацииЕГАИС.Добавить(СтрокаТаблицы.Производитель);
			ОрганизацииЕГАИС.Добавить(СтрокаТаблицы.Импортер);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыВопроса = Новый Структура();
	ПараметрыВопроса.Вставить("ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПоказатьВопросСопоставленияОрганизацииЕГАИСЗавершение", ЭтотОбъект, ПараметрыВопроса);
	
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросСопоставленияОрганизацииЕГАИСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуСопоставленияОрганизацииЕГАИС(ДополнительныеПараметры.ОрганизацииЕГАИС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСопоставленияОрганизацииЕГАИС(ОрганизацииЕГАИС)
	
	ПараметрыСопоставления = Новый Структура();
	ПараметрыСопоставления.Вставить("ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	
	АдресПараметров = ПоместитьВоВременноеХранилище(ПараметрыСопоставления);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("АдресВХранилище", АдресПараметров);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОткрытьФормуСопоставленияОповещениеОЗакрытии", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.СопоставлениеОрганизацийЕГАИСРТ.Форма", ПараметрыОткрытия,,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСопоставленияОповещениеОЗакрытии(ПараметрЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РежимСопоставленияИВыбора Тогда
		ОбновитьИнформациюОСопоставленииКонтрагентов();
	Иначе
		Элементы.СписокАлкогольнойПродукцииЕГАИС.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСвойствОтбора_Завершение(СписокСвойствСПометками, ДополнительныеПараметры) Экспорт
	
	Если СписокСвойствСПометками = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваОтбораНоменклатуры.Очистить();
	
	Для Каждого ЭлементСписка Из СписокСвойствСПометками Цикл
		Если ЭлементСписка.Пометка Тогда
			СвойстваОтбораНоменклатуры.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЕсли;
	КонецЦикла;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборНоменклатуры", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНеСопоставленныеОрганизацииНаСервере()
	
	ТаблицаНеСопоставленныеПроизводительИмпортер.Очистить();
	
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки Цикл 
		
		Если ВыделеннаяСтрока.Производитель <> Справочники.КлассификаторОрганизацийЕГАИС.ПустаяСсылка()
					И НЕ ВыделеннаяСтрока.Производитель.Сопоставлено
				ИЛИ ВыделеннаяСтрока.Импортер <> Справочники.КлассификаторОрганизацийЕГАИС.ПустаяСсылка()
					И НЕ ВыделеннаяСтрока.Импортер.Сопоставлено ТОГДА 
					
			НоваяСтрока = ТаблицаНеСопоставленныеПроизводительИмпортер.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыделеннаяСтрока, "Производитель, Импортер");
					
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСпискиНеСопоставленныхНаСервере()
	
	ТаблицаНеСопоставленнойАлкогольнойПродукции.Очистить();
	ТаблицаНеСопоставленнойНоменклатуры.Очистить();
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого Номенклатура Из Элементы.СписокНоменклатуры.ВыделенныеСтроки Цикл 
		НоваяЗапись = ТаблицаНеСопоставленнойНоменклатуры.Добавить();
		НоваяЗапись.Номенклатура = Номенклатура;
	КонецЦикла;
	
	Для Каждого АлкогольнаяПродукция Из Элементы.СписокАлкогольнойПродукцииЕГАИС.ВыделенныеСтроки Цикл
		НоваяЗапись = ТаблицаНеСопоставленнойАлкогольнойПродукции.Добавить();
		НоваяЗапись.АлкогольнаяПродукция = АлкогольнаяПродукция;
	КонецЦикла;
	
	ТаблицаАлкогольнаяПродукция = ТаблицаНеСопоставленнойАлкогольнойПродукции.Выгрузить();
	ТаблицаНоменклатура = ТаблицаНеСопоставленнойНоменклатуры.Выгрузить();
	
	ТаблицаАлкогольнаяПродукция.Свернуть("АлкогольнаяПродукция");
	ТаблицаНоменклатура.Свернуть("Номенклатура");
	
	СтруктураРезультат.Вставить("АлкогольнаяПродукция", ТаблицаАлкогольнаяПродукция);
	СтруктураРезультат.Вставить("Номенклатура", ТаблицаНоменклатура);
		
	Адрес = ПоместитьВоВременноеХранилище(СтруктураРезультат, УникальныйИдентификатор);
	
	Возврат Адрес;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСопоставленныеТовары(УникальныйИдентификатор)
	
	НачатьТранзакцию();
	
	Попытка
		
		ДокументОбъект = ТТН.ПолучитьОбъект();
		ДокументОбъект.Заблокировать();
		ДокументЗаблокирован = Истина;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		
		МассивСтрокДляВыгрузки = ДокументОбъект.Товары.НайтиСтроки(СтруктураОтбора);
		
		ТаблицаСопоставления = ДокументОбъект.Товары.Выгрузить(МассивСтрокДляВыгрузки,"АлкогольнаяПродукция, ИдентификаторУпаковки, НомерСтроки, Серия");
		ИнтеграцияЕГАИС.ЗаполнитьСопоставленнуюПродукцию(ТаблицаСопоставления);
		
		Для Каждого ТекСтрока Из ТаблицаСопоставления Цикл
			
			ПараметрыОтбораСтрокНакладной = Новый Структура;
			ПараметрыОтбораСтрокНакладной.Вставить("АлкогольнаяПродукция",  ТекСтрока.АлкогольнаяПродукция);
			ПараметрыОтбораСтрокНакладной.Вставить("ИдентификаторУпаковки", ТекСтрока.ИдентификаторУпаковки);
			
			Для Каждого СтрокаДокумента Из ДокументОбъект.Товары.НайтиСтроки(ПараметрыОтбораСтрокНакладной) Цикл
				СтрокаДокумента.Номенклатура  = ТекСтрока.Номенклатура;
				СтрокаДокумента.Характеристика = ТекСтрока.Характеристика;
			КонецЦикла;
			
		КонецЦикла;
		
		Если ДокументОбъект <> Неопределено И Не РежимСопоставленияПоНакладной Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ИнтеграцияЕГАИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Если ТаблицаСопоставления = Неопределено Тогда 
		АдресВоВременномХранилище = Неопределено;
	Иначе 
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТаблицаСопоставления, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемВопросЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		Результат = ЗаполнитьСопоставленныеТовары(ВладелецФормы.УникальныйИдентификатор);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Ссылка", Неопределено);
		Оповестить("ИзменениеСопоставленияАлкогольнойПродукцииЕГАИС", ПараметрыОповещения, ЭтаФорма);
		
		ПроизводилисьДействия = Ложь;
		Закрыть(Результат);
				
	КонецЕсли;

КонецПроцедуры


#КонецОбласти
